## Quiz #0203

In [38]:
import pandas as pd
import numpy as np
import os

#### Read in the data.

In [39]:
# Go to the directory where the data file is located. 
# os.chdir(r'~~')                # Please, replace the path with your own.

In [40]:
df = pd.read_csv('data_sales.csv', header='infer')

In [41]:
df.shape

(43, 5)

In [42]:
df.head(5)

          Date   Region     Item  UnitPrice  Units
0   4-Jul-2014     East  Pen Set       4.99     62
1  12-Jul-2014     East   Binder       1.99     29
2  21-Jul-2014  Central  Pen Set      12.49     55
3  29-Jul-2014     East   Binder      19.99     81
4   7-Aug-2014  Central  Pen Set      23.95     42

#### Answer the following questions.

1). Append a new variable $Amount = UnitPric \times Units$.

In [43]:
amount = df['UnitPrice']*df['Units']
df['Amount']= amount
df.head(10)

          Date   Region     Item  UnitPrice  Units   Amount
0   4-Jul-2014     East  Pen Set       4.99     62   309.38
1  12-Jul-2014     East   Binder       1.99     29    57.71
2  21-Jul-2014  Central  Pen Set      12.49     55   686.95
3  29-Jul-2014     East   Binder      19.99     81  1619.19
4   7-Aug-2014  Central  Pen Set      23.95     42  1005.90
5  15-Aug-2014     East   Pencil       4.99     35   174.65
6  24-Aug-2014     West     Desk     275.00      3   825.00
7   1-Sep-2014  Central     Desk     125.00      2   250.00
8  10-Sep-2014  Central   Pencil       1.29      7     9.03
9  18-Sep-2014     East  Pen Set      15.99     16   255.84

2). Average unit price for each region. Use the groupby() method.

In [44]:
df.groupby('Region', as_index=False)['UnitPrice'].mean()

    Region  UnitPrice
0  Central  18.018750
1     East   9.143846
2     West  53.658333

3). Average unit price for each region. Use the pivot_table() method.

In [45]:
pd.pivot_table(df,index=["Region"],values=["UnitPrice"])

         UnitPrice
Region
Central  18.018750
East      9.143846
West     53.658333

4). Average unit price and units for each region in one code sentence. Use the groupby() method.

In [50]:
df.groupby('Region', as_index=False)[["UnitPrice", "Units"]].mean()

    Region  UnitPrice      Units
0  Central  18.018750  49.958333
1     East   9.143846  53.153846
2     West  53.658333  38.500000

5). Average unit price and units for each region in one code sentence. Use the pivot_table() method.

In [47]:
pd.pivot_table(df,index=["Region"] ,values=(["UnitPrice" , "Units"]))

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

6). Total units for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [48]:
pd.pivot_table(df,index=["Region" , "Item"],values=["Units"], fill_value=0, aggfunc=np.sum)

                 Units
Region  Item
Central Binder     424
        Desk         7
        Pen         27
        Pen Set    243
        Pencil     498
East    Binder     234
        Pen        175
        Pen Set    152
        Pencil     130
West    Binder      64
        Desk         3
        Pen         76
        Pencil      88

7). Total sales amount for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [49]:
pd.pivot_table(df,index=["Region" , "Item"],values=["Amount"], fill_value=0, aggfunc=np.sum)

                  Amount
Region  Item
Central Binder   5762.63
        Desk      875.00
        Pen       539.73
        Pen Set  2421.39
        Pencil   1540.32
East    Binder   2535.66
        Pen      1354.25
        Pen Set  1748.48
        Pencil    363.70
West    Binder   1279.36
        Desk      825.00
        Pen       151.24
        Pencil    231.12